# 1)მომხმარებელს შემოატანინეთ 3 რიცხვი და გამოიტანეთ მაგ სამი რიცხვის ჯამი 

# მომხმარებლისგან 3 რიცხვის მიღება
num1 = float(input("შეიყვანე პირველი რიცხვი: "))
num2 = float(input("შეიყვანე მეორე რიცხვი: "))
num3 = float(input("შეიყვანე მესამე რიცხვი: "))

# ჯამის გამოთვლა
sum_numbers = num1 + num2 + num3

# შედეგის დაბეჭდვა
print("სამი რიცხვის ჯამია:", sum_numbers)

# 2)დაბეჭდეთ რიცხვები 10 - 1 მდე 

for number in range(10, 0, -1):
    print(number)

# 3)დაბეჭდეთ 1- 100 რიცხვი მხოლოდ კენტები

for number in range(1, 101):
    if number % 2 != 0:
        print(number)

# 4)დაბეჭდეთ ყველა რიცხვი რომელიც 3 ზე უნაშთოდ იყოფა 1- 100

for number in range(1, 101):
    if number % 3 == 0:
        print(number)

# 5)იპოვეთ 1 - 100 რიცხვის ჯამი 

# ჯამის საწყისი მნიშვნელობა
total_sum = 0

# ციკლი 1-დან 100-მდე
for number in range(1, 101):
    total_sum += number  # თითოეული რიცხვის დამატება ჯამში

print("1-დან 100-მდე რიცხვის ჯამი არის:", total_sum)
