# 4) შემოატანინეთ მომხმარებელს ასო თუ ეს ასო არის 'A' მაშინ გამოიტანეთ რიცხვი 100, თუ ის არის 'B' - 80, თუ 'C' - 60, თუ 'D' - 40, ხოლო თუ 'F' მაშინ სიტყვა 'Failed!'

# შემოატანინეთ ასო მომხმარებლისგან
grade = input("შეიყვანეთ ასო (A, B, C, D, F): ").upper()

# გადამოწმება და შესაბამისი შედეგის გამოყვანა
if grade == 'A':
    print(100)
elif grade == 'B':
    print(80)
elif grade == 'C':
    print(60)
elif grade == 'D':
    print(40)
elif grade == 'F':
    print("Failed!")
else:
    print("არასწორი ასო!")
