# 4)აქამდე ნასწავლი თაგები რაც გაქვთ კომენტარებით ახსენით რას შვება, აქამდე ნასწავლი თაგები: (head, body, title, meta, p, h1-h6, button, img, table)

# 1. <head> — მჟღავნდება დოკუმენტის მეტა-ინფორმაცია (მაგ: ქუდი, გამეორება, სტილები, სკრიპტები).

# 2. <body> — ყველა მთავარი კონტენტი (ტექსტი, გამოსახულებები და ა.შ.).<body> — ყველა მთავარი კონტენტი (ტექსტი, გამოსახულებები და ა.შ.).

# 3. <title> — დოკუმენტის სათაური, რომელიც გამოჩნდება ბრაუზერის ტაბში.

# 4. <meta> - არის ინფორმაციის უზრყნველსაყოფად, რომელსაც აქვს სხვადასხვა ატრიბუტი 

# 5. <p> — პარაგრაფი (ტექსტის ბლოკი).

# 6. <h1> - <h6> — სათაურები, <h1> ყველაზე მაღალი დონის სათაურია.

# 7. button – საერთო ღილაკი (უმეტესად JavaScript-ის შიდა მოქმედებებისთვის).

# 8. <img> — გამოსახულება.

# 9. <table> - ცხრილი.