# 1)კომენტარების სახით ჩამოწერეთ  ყველა პილიუსი და მინუსი set -ების.

# პლუსები:

# 1. უნიკალურობა: თითოეული ელემენტი აქვს უნიკალური მნიშვნელობა, რაც საშუალებას აძლევს ადვილად იდენტიფიციროს და მართოს.
# 2. არეომეტრიულობა: set-ები არ იძლევიან დუბლიკატების საშუალებას, რაც ნიშნავს, რომ თითოეული ელემენტი უნიკალურია.
# 3. სწრაფი ძიება: set-ების გამოყენებით, ელემენტების ძიება ხდება უფრო სწრაფად, რადგან ისინი შენახულია ჰეშ-ტექნოლოგიით.

# მინუსები:

# 1. არ არის ინდექსირებული: set-ებში ელემენტებს არ აქვთ ინდექსი, რაც complicates მათი წვდომა.
# 2. მეხსიერების ხარჯები: set-ები შეიძლება მოითხოვონ მეტი მეხსიერება, ვიდრე სხვა მონაცემთა სტრუქტურები, როგორიცაა სია.
# 3. არ არის სექვენციური: set-ები არ ინახავენ ელემენტების რიგს, რაც შეიძლება იყოს პრობლემური, როდესაც საჭიროა ელემენტების გარკვეული თანმიმდევრობით დამუშავება.