# 2) მომხმარებელს შემოატანინეთ ორი რიცხვითი მნიშვნელობა (სიგანე და სიმაღლე). ტერმინალში გამოიტანეთ ფართობი/პერიმეტრი. S = ფართობი (S = width*height)/P = პერიმეტრი (P = (width+height)*2


width = int(input("შეიყვანე სიგანე: "))
height = int(input("შეიყვანე სიმაღლე: "))


S = width * height
P = (width + height) * 2


print("\nშედეგები:")
print(f"ფართობი (S): {S}")
print(f"პერიმეტრი (P): {P}")

# შეიყვანე სიგანე: 5
# შეიყვანე სიმაღლე: 3

# შედეგები:
# ფართობი (S): 15
# პერიმეტრი (P): 16


print(f"ფართობი (S = width * height): {S}")
print(f"პერიმეტრი (P = (width + height) * 2): {P}")
