# 2) ახსენი რომელი არის აუცილებელი ატრიბუტი და არჩევადი.


# აუცილებელი ატრიბუტი:

# ეს არის ისეთი ატრიბუტი, რომელსაც აუცილებლად უნდა მივაწოდოთ მნიშვნელობა ობიექტის შექმნის დროს.
#  თუ არ მივაწვდით — პროგრამა შეცდომას გვაჩვენებს.

# ▶ მაგალითი:

# class მანქანა:

# def __init__(self, მოდელი):
# self.მოდელი = მოდელი  # აუცილებელი ატრიბუტი

# m = მანქანა("Toyota")  # სწორია
# m2 = მანქანა()         # შეცდომა — მოდელი აუცილებელია!


# არჩევადი ატრიბუტი:

# ეს არის ატრიბუტი, რომელსაც შეიძლება მივაწოდოთ, მაგრამ სავალდებულო არ არის, რადგან აქვს ნაგულისხმევი მნიშვნელობა.

# ▶ მაგალითი:

# class მანქანა:

# def __init__(self, მოდელი, ფერი="შავი"):
# self.მოდელი = მოდელი # აუცილებელი

# self.ფერი = ფერი # არჩევა

# m1 = მანქანა("BMW") # ფერი იქნება "შავი"
# m2 = მანქანა("Mercedes", "თეთრი") # ფერი იქნება "თეთრი"