# 4) მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა.

# მომხმარებლისგან რიცხვის მოთხოვნა (თავდაპირველად)
i = int(input("შეიყვანე რიცხვი: "))

# while ციკლის თავი: სანამ რიცხვი 100-ზე ნაკლები ან ტოლია, ისევ ითხოვს
while i <= 100:
    print("რიცხვი უნდა იყოს 100-ზე მეტი. თავიდან სცადე.")
    # while-ის სხეული: თავიდან ითხოვს რიცხვს
    i = int(input("შეიყვანე რიცხვი: "))

# ციკლის დასრულების შემდეგ
print("გმადლობთ! სწორი რიცხვი:", i)