# 4)დაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს პაროლის შეყვანას. სწორი პაროლია "python123". სანამ სწორად არ შეიყვანს, მოთხოვე თავიდან.

# სწორი პაროლი
correct_password = "python123"

# სთხოვს მომხმარებელს პირველად შეიყვანოს პაროლი
password = input("შეიყვანე პაროლი: ")

# while ციკლი გაგრძელდება მანამ, სანამ პაროლი არ იქნება სწორი
while password != correct_password:
    print("პაროლი არასწორია. სცადე თავიდან.")
    password = input("შეიყვანე პაროლი: ")

# როცა მომხმარებელი სწორად შეიყვანს
print("პაროლი სწორია. წვდომა ნებადართულია!")