# 1) შექმენით ხუთი ცვლადი და გამოიყენეთ ეს ცვლადები რომ შეადგინოთ წინადადება

saxeli = "გიორგი"
surname = "მაზანიშვილი"
age = "13"
qalaqi = "რუსთავი"
hobi = "ფეხბურთის თამაში"


print ("მე ვარ", + saxeli + surname + ",", age , "წლის. + ვცხოვრობ ქალაქ", qalaqi + "-ში და ჰობი არის", hobi + ".")

# 2) დაარქვით ამ ცვლადებს snake_case სინტაქსით

first_name = "გიორგი"
last_name = "მაზანიშვილი"
age = "13"
city = "რუსთავი"
hobby = "ფეხბურთის თამაში"

print(f"მე ვარ {first_name} {last_name}, {age} წლის. ვცხოვრობ ქალაქ {city}-ში და ჩემი ჰობი არის {hobby}.")
