# 3) მომხმარებელს შეატანინეთ მისი სახელი გვარი და ასაკი და შემდეგ გამოიტანეთ ისინი outpout-ში შედეგი გამოსახულებით -სახელი: {შემოყვანილი სახელი}- (იგივე ყველა ცვლადზე).

first_name = input("შეიყვანეთ თქვენი სახელი: ")
last_name = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")

first_name = input("შეიყვანეთ თქვენი სახელი: ")
last_name = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")


print(f"-სახელი: {first_name}- გვარი: {last_name}- ასაკი: {age}-")
