# 5) მომხმარებელს შემოატანინეთ ორი სტრინგი და თუ ეს სტრინგები ერთმანეთს ემთხვევა გამოიტანეთ True ხოლო თუ არ ემთხვევა გამოიტანეთ False

string1 = input("შეიყვანეთ პირველი სტრინგი: ")
string2 = input("შეიყვანეთ მეორე სტრინგი: ")

if string1 == string2:
    print(True)
else:
    print(False)

    print("-------------------------------------")

    # Bonus) გააკეთეთ მეხუთე if-ის გარეშე

    # მომხმარებლისგან ორი სტრინგის მიღება
string1 = input("შეიყვანეთ პირველი სტრინგი: ")
string2 = input("შეიყვანეთ მეორე სტრინგი: ")

# სტრინგების შედარება და შედეგის დაბეჭდვა
print(string1 == string2)