# 1)
# --ახსენი რისთვის გამოიყენება ინდექსინი, 

# ინდექსი გამოიყენება მონაცემთა ბაზებში (და ზოგადად კომპიუტერულ სისტემებში) მონაცემებზე სწრაფად წვდომის უზრუნველსაყოფად.

# --დაწერე ინდექსინგის  მაგალიათი ანუ შექმენი დიდი სია და გამოიყენე ინდექსინგი და დაპრინე მე 0-ინდექსი 1-ინდექსი,
# 2-ინდექსი 3-ინდექსი 4-ინდექსი და ასევე 5 ჯერ შეუცვალე მნიშვნელობა სიაში არებულ ელემენტებს ინდექსინგის მეშვეობით.

my_list = list(range(100))

print("0-ინდექსი:", my_list[0])
print("1-ინდექსი:", my_list[1])
print("2-ინდექსი:", my_list[2])
print("3-ინდექსი:", my_list[3])
print("4-ინდექსი:", my_list[4])
