# 1)დავალება: გამოიყენე for ციკლი, რომ დაბეჭდო რიცხვები 1-დან 10-მდე.

# for ციკლი ივლება 1-დან 10-მდე (10 ჩათვლით)
for number in range(1, 11):
    print(number)

# 2)დაბეჭდე სიტყვა "Hello world" ხუთჯერ, ყოველი დაბეჭდვა ახალ ხაზზე.

for _ in range(5):
    print("Hello world")

# 3) გამოიყენე for ციკლი, რომ დაბეჭდო მხოლოდ ლუწი რიცხვები  10.

for number in range(1, 11):  # 1-დან 10-მდე (10 ჩათვლით)
    if number % 2 == 0:     # თუ რიცხვი ლუწია
        print(number)

# 4)უყურეთ ჩანაწერს

# 5)და კომენტარებით ახსენი რა არის for loop 

for i in range(5):
    print(i)

# for ციკლი გამოდგება, როცა გინდა ავტომატურად გაიმეორო კოდი გარკვეული რაოდენობით ან ელემენტებზე.

# იტერაციაზე ცვლადი (i ამ მაგალითში) იღებს თითოეულ მნიშვნელობას და შეგიძლია მისი გამოყენება ციკლის სხეულში.

# კომენტარებით ახსნა:

# for ციკლი — არის კონტროლური სტრუქტურა, რომელიც გამოიყენება კოდის გავმეორებისთვის (იტერაციისთვის) განსაზღვრულ რაოდენობაზე ან კოლექციაზე.

# for i in range(5):

# for — ციკლის საწყისი სიტყვა.

# i — ცვლადი, რომელიც იკავებს თითოეულ მნიშვნელობას იტერაციისას.

# in — განსაზღვრავს, სად ხდება დააზუსტება (ან რას ვცვლით).

# range(5) — ქმნის რიცხვების თანმიმდევრობას 0-დან 4-მდე (5 არ შედის).

# ციკლის სხეული — ყველაფერი, რაც for ხაზის ქვემოთაა და ზედაა ჩამოწერილი (indent-ით გამოყოფილი), ის შესრულდება თითოეულ იტერაციაზე.