# 18) ახსენი რას აკეთებს :target.

# :target სელექტორი გამოიყენება CSS-ში იმისთვის, რომ აირჩიოს HTML ელემენტი, რომელიც არის URL-ის ფрагმენტის იდენტიფიკატორის (ID) შესაბამისი. მაგალითად, თუ URL არის "http://example.com/page#section1", მაშინ :target სელექტორი აირჩევს ელემენტს, რომლის ID არის "section1". ეს სელექტორი ხშირად გამოიყენება გვერდის შიგნით ნავიგაციისთვის, რათა გამოჩნდეს კონკრეტული ნაწილი ან განყოფილება, როდესაც მომხმარებელი გადადის URL-ის შესაბამის ფрагმენტზე.
# მაგალითი:

# HTML:

# <div id="section1">Section 1 Content</div>   

# css:

#section1:target {
#     background-color: yellow;
# }
