# 1) შეიყვანე სიტყვა, სანამ პირველი და ბოლო ასო არ იქნება თანხმოვანი.
#  რას ნიშნავს?
# შენ უნდა უთხრა რობოტს სიტყვები.
# მაგრამ რობოტი შეგეკითხება ბევრჯერ, სანამ არ ეტყვი ისეთ სიტყვას, რომლის პირველი ასოც და ბოლო ასოც არცერთი არ არის ხმოვანი (ანუ არ არის ა, ე, ი, ო, უ).

#  მაგალითი:

# სიტყვა: მარიამი → პირველი: მ (კარგია), ბოლო: ი (ხმოვანი ❌) → რობოტი არ მიიღებს

# სიტყვა: ბაღი → ბ (კარგია), ი (ხმოვანი ❌) → არ მიიღებს

# სიტყვა: ბაბუა → ბ (კარგია), ა (ხმოვანი ❌) → არ მიიღებს

# სიტყვა: ბამბა → ბ (კარგია), ა (ხმოვანი ❌) → არ მიიღებს

# სიტყვა: კურდღელთ → კ (კარგია), თ (კარგია ✅✅) → აი ეს უკვე სწორი სიტყვაა!

def is_consonant(c):
    vowels = "ბგდზთკლმნპჟრ"
    return c in vowels

user_input = input("შეიყვანეთ ტექსტი: ")

while not (is_consonant(user_input[0]) and is_consonant(user_input[-1])):
    user_input = input("შეიყვანეთ ტექსტი: ")

print("შესაბამისი ტექსტი:", user_input)