# 2) შეიყვანე 5 სიტყვა, მაგრამ შეინახე (დაახსოვრე) მხოლოდ ისინი, რომლებიც სწორია.
#  რა არის „სწორი“ სიტყვა?
# ამაში უნდა გითხრან წინასწარ რა კრიტერიუმით აირჩიე სწორი, მაგრამ დავუშვათ, სიტყვა სწორია მაშინ, როცა მასში ორივე — პირველი და ბოლო ასოები — თანხმოვნებია.

# შენ უნდა უთხრა 5 სიტყვა. რობოტი კი შეინახავს მხოლოდ იმ სიტყვებს, რომლებიც სწორია.

def is_consonant(c):
    vowels = "ბგდზთკლმნპჟრ"
    return c in vowels

correct_words = []

for _ in range(5):
    user_input = input("შეიყვანეთ სიტყვა: ")
    if is_consonant(user_input[0]) and is_consonant(user_input[-1]):
        correct_words.append(user_input)

print("შესაბამისი სიტყვები:", correct_words)