# 1) გაიარეთ რეგისტრაცია sololearn-ზე (sololearn.com)

# 2) უყურეთ ჩანაწერს თავიდან ბოლომდე

# 3) მომხმარებელს შემოატანინეთ მისი სახელი და შემდეგ დაპრინტეთ
# მომხმარებლის სახელი


# 4) შექმენით 5-5 მაგალითი მათემატიკურ ოპერატორებზე +, -, * და /


# 2) რიცხვების გამოკლება (-)

example1 = 10 - 5
example2 = 20 - 10
example3 = 15 - 3
example4 = 30 - 15
example5 = 50 - 25
# 3) გამრავლება (*)

example1 = 5 * 2
example2 = 10 * 4
example3 = 3 * 3
example4 = 7 * 5
example5 = 25 * 4

# 4) გამყოფი (/)

example1 = 10 / 2
example2 = 20 / 4
example3 = 9 / 3
example4 = 15 / 5
example5 = 100 / 25
print(f"Division Examples: {example1}, {example2}, {example3}, {example4}, {example5}")

# 5) შექმენით 5 ცვლადი სადაც შეინახავთ თქვენზე ინფორმაციას და შემდეგ დაპრინტეთ თითოეული მათგანი
# 1) სახელი
name = "გიორგი"

# 2) ასაკი
age = 25

# 3) ქალაქი
city = "თბილისი"


# 4) პროფესიები
profession = "პროგრამისტი"

# 5) საყვარელი ჰობა
hobby = "გატაცება კოდირებისადმი"


# პრინტები თითოეული ცვლადის შესახებ
print(f"სახელი: {name}")
print(f"ასაკი: {age}")
print(f"ქალაქი: {city}")
print(f"პროფესია: {profession}")
print(f"საყვარელი ჰობა: {hobby}")

# 6) გაიარეთ sololearn-ი აქამდე (თუ გულები ამოგეწურათ არაუშავს): 