# 2) მომხმარებელს სთხოვე შეიყვანოს თავისი ასაკი და მიუთითოს, აქვს თუ არა სტუდენტური ბარათი
# შემდეგ:
# თუ ასაკი ნაკლებია 18-ზე ან სტუდენტური ბარათი აქვს → დაბეჭდე "დანაზოგი გაქვს!"
# თუ ასაკი 60 ან მეტია და არ აქვს ბარათი → დაბეჭდე "პენსიონერის ფასდაკლება გაქვს!"
# სხვა შემთხვევაში → "ფასდაკლება არ გეკუთვნის."

age = int(input("შეიყვანეთ თქვენი ასაკი: "))
has_student_card = input("გაქვთ თუ არა სტუდენტური ბარათი? (დიახ/არა): ").strip().lower()

if age < 25:
    if has_student_card == "დიახ":
        print("თქვენი ასაკი არის {} და გაქვთ სტუდენტური ბარათი.".format(age))
    else:
        print("თქვენი ასაკი არის {}, მაგრამ არ გაქვთ სტუდენტური ბარათი.".format(age))
else:
    print("თქვენი ასაკი არის {}, სტუდენტური ბარათი არ გჭირდებათ.".format(age))