# 2) მიუწერე, რას აკეთებს თითო ქვემოთ ჩამოთვლილი თაგი:

# <b> - ტეგი HTML-ში იყენება ტექსტის გასასმელებლად (bold). თუმცა, ის არ ასახავს განსაკუთრებულ მნიშვნელობას ან კონტექსტს. ეს მხოლოდ ვიზუალური ეფექტია.  

# <i> - ტეგი HTML-ში ტექსტისთვის გამოიყენება, რათა მას მიიღოს italic ფორმატი (მხატვრული სტილი). თუმცა, ის მხოლოდ ვიზუალურ ეფექტს ქმნის და არანაირ კონტექსტურ მნიშვნელობას არ ატარებს.

# <u> - ტეგი HTML-ში გამოიყენება ტექსტის ქვეშ ხაზგასასმელად (underline). მას მხოლოდ ვიზუალური ეფექტი აქვს, არ გამოხატავს არც განსაკუთრებულ მნიშვნელობას, არც კონტექსტს.
 
# <em> - ტეგი HTML-ში გამოიყენება ტექსტის გამოკვეთვის მიზნით, რაც არ ნიშნავს მხოლოდ ვიზუალურ ცვლილებას, არამედ ნიშნავს რომ ტექსტი არის მნიშვნელოვანი. როგორც წესი, <em> ტექსტს იტალიკ ფორმატში აქცევს, მაგრამ მისი მთავარი დანიშნულება მნიშვნელობის გამოხატვაა.

# <strong> -  ტეგი HTML-ში გამოიყენება ტექსტის მნიშვნელოვნად გამოკვეთისთვის. ეს არა მხოლოდ ვიზუალურ სტილს, არამედ სემანტიკურ მნიშვნელობას აძლევს ტექსტს, რაც იმას ნიშნავს, რომ ტექსტი არის "ძალიან მნიშვნელოვანი".

# (1-2 წინადადება თითო თაგზე საკმარისია)

