# 3) ჩაწერე რომელ თაგებს ზემოთ ჩამოთვლილთაგან ეწოდება სემანტიკური და რომელთას არა. შეგიძლია ჩამოწერო კომენტარი სახით, მაგალითად:

# Tag    სემანტიკური?    აღწერა
# <b>    არა    ტეხავს ტექსტს სქელად
# <strong>    კი    ხაზს უსვამს მნიშვნელობას

# <b> — არ არის სემანტიკური; მხოლოდ ვიზუალურად ასვამს ტექსტს სქელად, მაგრამ არ აქვს მნიშვნელობის გამოხატვა.

# <strong> — სემანტიკური; ხაზს უსვამს ტექსტის მნიშვნელობას, რის შედეგადაც საძიებო სისტემები და სხვა დახმარების ტექნოლოგიები უკეთ აღიქვამენ.

# <i> — არ არის სემანტიკური; მხოლოდ ვიზუალური სტილი (იტალიკი), მაგრამ არ აქვს განსაკუთრებული მნიშვნელობა.

# <em> — სემანტიკური; გამოკვეთავს ტექსტის მნიშვნელობას და ხშირად ნიშნავს, რომ მას განსაკუთრებული მნიშვნელობა აქვს.

# <u> — არ არის სემანტიკური; მხოლოდ ვიზუალურად ხაზავს ტექსტს, მაგრამ არ აქვს კონკრეტული კონტექსტი.

# <ins> — სემანტიკური; აღნიშნავს ტექსტის ცვლილებას, ანუ იგი არის "დამატებული" შინაარსი.