#  6) ასევე ახსენით თითოეული: Start end center space-between space-around space-evenly strech.

# Start - ელემენტები იწყება კონტეინერის დასაწყისიდან.
# End - ელემენტები იწყება კონტეინერის ბოლოსგან.
# Center - ელემენტები ცენტრშია განლაგებული.
# Space-between - ელემენტები თანაბრად არის განაწილებული, პირველი ელემენტი არის დასაწყისში, ხოლო ბოლო ელემენტი არის ბოლოს.
# Space-around - ელემენტები თანაბრად არის განაწილებული, მათ შორის სივრცით.
# Space-evenly - ელემენტები თანაბრად არის განაწილებული, მათ შორის თანაბარი სივრცით.
# Stretch - ელემენტები იწელება, რომ შეავსოს კონტეინერი. 
# მაგალითად, CSS-ში ეს თვისებები გამოიყენება ფლექსბოქსის და გრიდის კონტეინერებში ელემენტების განლაგებისას.