# 2) რისთვის გამოიყენება კომენტარები html ში და როგორ ვწერთ კომენტარებს?.

# HTML-ში კომენტარები გამოიყენება კოდის შიგნით ტექსტური შენიშვნებისა და ახსნა-განმარტებისათვის, რომლებიც არ გავლენ კონკრეტულად დოკუმენტის მუშაობაზე. კომენტარები არის ერთგვარი "შეფარული" ტექსტი, რომელსაც ბრაუზერი არ აჩვენებს მომხმარებელს. ისინი სასარგებლოა კოდის უკეთესად გასაგებად, ორგანიზება უკეთესად ორგანიზებისათვის ან კოდში ტესტირების/შეცვლებისთვის.

# HTML-ში კომენტარის სინტაქსი:
# HTML-ში კომენტარი იწყება <!-- და მთავრდება -->.

# კომენტარის მაგალითი:
# html
# Copy
# <!-- ეს არის კომენტარი -->
# <p>ეს არის პარაგრაფი.</p>

# <!-- ამ ეტაპზე კოდი არ მუშაობს, საჭიროებს გაუმჯობესებას -->
# <div>
# <p>მხოლოდ აღსანიშნავი ნაწილი</p>
# </div>