# 1) შექმენი for loop- რომელიც გამოიტანს 1-100 ჩატვლით რიცხვებს და ასევე კენტია თუ ლუწი ეს რიცხვი

for number in range(1, 101):  # 1-დან 100-მდე (100 ჩათვლით)
    if number % 2 == 0:
        print(f"{number} არის ლუწი")
    else:
        print(f"{number} არის კენტი")

# 2) მომხმარებელს შემოატანინეთ რიცხვი და და გამოიტანეთ ეს რიცხვი კენტია თუ ლუწი

# მომხმარებლისგან რიცხვის მიღება
number = int(input("შეიყვანე რიცხვი: "))

# შემოწმება ლუწი თუ კენტი
if number % 2 == 0:
    print(f"{number} არის ლუწი")
else:
    print(f"{number} არის კენტი")

# 3) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ 'მეტია' თუ მეორე რიცხვი პირველზე მეტია თუ არადა დაბეჭდეთ  ''ნაკლებია"

# მომხმარებლისგან ორი რიცხვის მიღება
num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

# შედარება და დაბეჭდვა
if num2 > num1:
    print("მეტია")
else:
    print("ნაკლებია")

# 4) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ უფრო მაღალი რიცხვი 

# მომხმარებლისგან ორი რიცხვის მიღება
num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

# შედარება და უფრო მაღალი რიცხვის დაბეჭდვა
if num1 > num2:
    print(f"უფრო მაღალი რიცხვია: {num1}")
elif num2 > num1:
    print(f"უფრო მაღალი რიცხვია: {num2}")
else:
    print("ორივე რიცხვი ტოლია")