# 3) ახსენი რა განსხვავებაა alert-სა და prompt-ს შორის.

# alert() ფუნქცია აჩვენებს შეტყობინების ფანჯარას, რომელიც შეიცავს ტექსტს, რომელიც გადაეცემა როგორც არგუმენტი. ეს ფუნქცია ხშირად გამოიყენება მომხმარებლის ინფორმაციის ან გაფრთხილების გასატანად.

# prompt() ფუნქცია ეკითხება მომხმარებელს კითხვას და ელოდება მისი პასუხის შეყვანას. ეს ფუნქცია ხშირად გამოიყენება მომხმარებლისგან ინფორმაციის ან მონაცემების მისაღებად.

# მთავარი განსხვავება არის ის, რომ alert() მხოლოდ აჩვენებს ინფორმაციას მომხმარებელს, ხოლო prompt() ითხოვს ინფორმაციას მომხმარებლისგან.