# 7) ასევე ახსენით თითოეული: Start end center space-between space-around space-evenly stretch justify-items align-items 

# Start - ელემენტები განლაგებულია კონტეინერის დასაწყისში.
# End - ელემენტები განლაგებულია კონტეინერის ბოლოს.
# Center - ელემენტები განლაგებულია კონტეინერის ცენტრში.
# Space-between - ელემენტები განლაგებულია ისე, რომ პირველი ელემენტი არის
# კონტეინერის დასაწყისში, ბოლო ელემენტი კი - ბოლოს, ხოლო დანარჩენი ელემენტები თანაბრად განაწილებულია მათ შორის.
# Space-around - ელემენტები განლაგებულია ისე, რომ თითოეული ელემენტის გარშემო არის თანაბარი სივრცე.
# Space-evenly - ელემენტები განლაგებულია თანაბარი სივრცით ერთმანეთისგან.
# Stretch - ელემენტები ფართოვდება ისე, რომ დაიკავონ ხელმისაწვდომი სივრცე კონტეინერში.
# Justify-items - განსაზღვრავს, თუ როგორ უნდა განლაგდეს ელემენტები ჰორიზონტალურად კონტეინერში.
# Align-items - განსაზღვრავს, თუ როგორ უნდა განლაგდეს ელემენტები ვერტიკალურად კონტეინერში.