# 1) წნევის ანალიზი:

# ა) მომხმარებელი შეიყვანს ორ მაჩვენებელს: სისტოლური და დიასტოლური წნევა.
# ბ) პროგრამამ უნდა განსაზღვროს წნევის კატეგორია:
# გ) თუ სისტოლური > 140 ან დიასტოლური > 90 → "მაღალი წნევა"
# დ) თუ სისტოლური < 90 ან დიასტოლური < 60 → "დაბალი წნევა"
# ე) სხვა შემთხვევაში → "წნევა ნორმალურია"

წნევა1 = int(input("შეიყვანე სისტოლური წნევა :"))
წნევა2 = int(input("შეიყვანე დიასტოლრი წნევა :"))

if წნევა1 > 140 or წნევა2 > 90:
    print("მაღალი წნევა")
elif წნევა1 < 90 or წნევა2 < 60:
    print("დაბალი წნევა")
else:
    print("წნევა ნორმალურია")