# 1) ახსენით რისთვის გამოიყენება კომენტარები html-ში.

# ✅ 1) რისთვის გამოიყენება კომენტარები HTML-ში:
# კომენტარები HTML-ში გამოიყენება იმისთვის, რომ დაამატო შენიშვნა ან ახსნა კოდში, რომელიც ბრაუზერში არ გამოჩნდება.

# კომენტარები არ აჩვენება ვებსაიტზე და მხოლოდ კოდის მკითხველისთვისაა განკუთვნილი (პროგრამისტისთვის ან იმ ადამიანისთვის, ვინც კოდს მომავალში წაიკითხავს).

# 🧠 ძირითადად გამოიყენება:
# კოდის ახსნისთვის

# დროებითად კოდის "გამორთვისთვის"

# დასამატებელი ცვლილებების აღსანიშნავად

# სხვებისთვის კოდის გასაგებად გასაგებად გაშიფვრის მიზნით



# მაგალითი:

# <!DOCTYPE html>
# <html>
# <head>
#     <title>ჩემი საიტი</title>
#     <!-- ეს ნაწილი აყენებს გვერდის სათაურს -->
# </head>
# <body>

#     <h1>მოგესალმებით!</h1>
#     <!-- ქვემოთ უნდა დაემატოს სურათი -->
#     <!-- <img src="photo.jpg" alt="სურათი"> -->

# </body>
# </html>
