# 1) იგივე ქლასვორქები რაც Day 7-ზე თუმცა for loop-ით

# ChatGPT said:
# მგონი შენგან მივიღე დავალება, რომელიც ეხება "Day 7"-ის მასალის გასაკეთებლად, მაგრამ ამჯერად for ციკლის გამოყენებით — ალბათ ადრე იყო რაღაც ქლასვორქები, რომლებსაც ახლა გინდა for-ით განავრცოთ.

# შენ შეგიძლია მითხრა კონკრეტულად რომელი მაგალითები ან დავალებები გაქვს Day 7-ზე?
# მაგალითად: რიცხვების დაბეჭდა, რიცხვების ჯამი, სტრიქონების ბეჭდა და ა.შ.

# ამ დროისთვის, დავწერე რამდენიმე ძირითადი მაგალითი, რომლებიც ხშირად ხდება Day 7-ის მსგავს მასალებში — მაგრამ ახლა for ციკლით:
# 1) დაბეჭდე რიცხვები 1-დან 10-მდე for ციკლით
# python
# Copy
# Edit
# for number in range(1, 11):
#     print(number)
# 2) დაბეჭდე სიტყვა "Hello world" 5-ჯერ
# python
# Copy
# Edit
# for _ in range(5):
# print("Hello world")
# 3) დაბეჭდე 1-დან n-მდე რიცხვების ჯამი (წინა მაგალითი while ციკლით იყო)
# python
# Copy
# Edit
# n = int(input("შეიყვანე რიცხვი n: "))
# sum_numbers = 0

# for i in range(1, n+1):
#     sum_numbers += i

# print("ჯამი 1-დან", n, "მდე არის:", sum_numbers)
# 4) მომხმარებლისგან ჩაწერე 5 სახელი და დაბეჭდე ისინი მძიმებით გამოყოფილი სტრიქონად
# python
# Copy
# Edit
# names = []

# for i in range(5):
#     name = input(f"შეიყვანე სახელი {i+1}: ")
#     names.append(name)

# result = ", ".join(names)
# print("შეყვანილი სახელები:", result)
