# 1) ახსენი რა არის semanticTag-ები 

# 1) „სემანტიკა“ ნიშნავს მნიშვნელობას. როცა ვამბობთ "სემანტიკური თეგი", ვგულისხმობთ HTML ელემენტს, რომელსაც აქვს გარკვეული მნიშვნელობა — მაგალითად, „ეს არის მენიუ“, „ეს არის სტატია“, „ეს არის გვერდის სათაური“ და ა.შ.

# -------------------------------------------------------------------------------------------------------------------

# 2) ასევე ახსენი text formatting -tag ებიდან თითოეული რას შვება.

# 2) Text formatting tag-ები HTML-ში — ეს არის ისეთი თეგები, რომლებიც გამოიყენება ტექსტის სტილის, ფორმატისა და მისი ვიზუალური გასაფორმებლად. ისინი არ შეცვლიან შინაარსის მნიშვნელობას, მაგრამ გავლენას ახდენენ იმაზე, როგორ იქნება ტექსტი წარმოდგენილი მომხმარებლისთვის.

# strong>	მნიშვნელოვანი (Strong) — ტექსტი ხდება გახლეჩილი და მას ხშირად წარმოადგენენ როგორც ძირითადი მნიშვნელობა (და ხშირად გამოკვეთილი).

# <i>	კურსივი (Italic) — ტექსტი ხდება კურსივით (ან კინეტურად დახრილი).

# <em>	მნიშვნელობა (Emphasis) — ვამაგრებს მნიშვნელობას ტექსტზე, რომელთა ხშირად კურსივში გამოჩნდება.

# <u>	ხაზის ქვედა (Underline) — ხაზის გადალახვა ტექსტზე.

# --------------------------------------------------------------------------------------------------------
 
# 3) text formatting -tag-ები : <b> <i> <u> <em> <strong> 

# 3) <b> გამოკვეთილი (Bold) — ტექსტი ხდება განზოგადებული გამოკვეთილი (ზედმეტად სქელი).

# <i> კურსივი (Italic) — ტექსტი ხდება კურსივით (ან კინეტურად დახრილი).

# <u> ხაზის ქვედა (Underline) — ხაზის გადალახვა ტექსტზე.

# <em> მნიშვნელობა (Emphasis) — ვამაგრებს მნიშვნელობას ტექსტზე, რომელთა ხშირად კურსივში გამოჩნდება.

# ---------------------------------------------------------------------------------------------------------------------- 
 
# 4) და აქედან რომელია სემატიკური თაგი.

# <b> გამოკვეთილი (Bold) — ტექსტი ხდება განზოგადებული გამოკვეთილი (ზედმეტად სქელი).

# <article> — გამოიყენება თითოეული სტატიისთვის ან გამოყოფილი შინაარსისთვის.

# <section> — აღნიშნავს გვერდის განყოფილებას, რომელიც შეიცავს კონკრეტულ თემას.

# <header> — გვერდის ან განყოფილების სათაურის ნაწილისთვის.

# <footer> — გვერდის ან განყოფილების ქვედა ნაწილისთვის, სადაც ხშირად
