# 2) რაში გვეხმარება ინდექსინგი? რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით? შეგვიძლია თუ არა სტრინგების შეცვლა?.
 
# 1)
# ინდექსინგი — ერთ-ერთი ყველაზე მნიშვნელოვანი მახასიათებელია სიებში (ლისტებში), სტრიქონებში, ტუპლებში და სხვა კოლექციებში პროგრამირებაში.

fruits = ["ვაშლი", "ატამი", "ბანანი"]
print(fruits[0]) 


# 2)
#  რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით?.

# ინდექსინგის მეშვეობით Python-ში და ზოგადად პროგრამირებაში შეგვიძლია ბევრი მნიშვნელოვანი მოქმედება ელემენტებზე წვდომის და მონაცემთა მართვის თვალსაზრისით.

# მაგალითი:

names = ["ანა", "ლუკა", "ნიკა"]
print(names[0])


# 3)
# შეგვიძლია თუ არა სტრინგების შეცვლა?

# 🔹 სტრინგების შეცვლა პირდაპირ არ შეიძლება, რადგან ისინი არიან უცვლადნი.
# 🔹 შეცვლა შესაძლებელია ახალი სტრინგის შექმნით.

# მაგალითი:

text = "მარიამი"
new_text = "ნ" + text[1:]
print(new_text)
