# 3) txt = "hello world, python html" 
# --დაბეჭდეთ სტრინგის პირველი ასო,
# --დაბეჭდეთ სტრინგის ბოლო ასო ნეგატიური ინდექსის გამოყენებით,
# --ახსენი როგორ მუშაობს ინდექსები ანუ საიდან იწყება ასევე ნეგატიური ინდექსი საიდან იწყება.

# 1.
txt = "hello world, python html" 
print(txt[0])  

# 2.
print(txt[-1])


# 3.
#  | ასო | h | e | l | l | o |   | w | o | r | l | d  | ,  |    | p  | y  | t  | h  | o  | n  |    | h  | t  | m  | l  |
#  | ------- | - | - | - | - | - | - | - | - | - | - | -- | -- | -- | -- | -- | -- | -- | -- | -- | -- | -- | -- | -- | -- |
#  | ინდექსი | 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20 | 21 | 22 | 23 |
