#  1)შექმენით index.html ფაილი


#  2)გამოიტანეთ "hellow world" 

print("hello world")

#  3)უყურეთ ჩანაწერს თავიდან ბოლომდე 


#  4)კომენტარებით ახსენი html და რაში ვიყენებთ 

# <!-- 
#     HTML (HyperText Markup Language) არის ვებ-გვერდების დასაშვებ, სტრუქტურას განსაზღვრავს ენას. 
#     HTML-ს საშუალებით ვქმნით ვებ-გვერდების "კონტენტს" — ტექსტებს, სურათებს, ბმულებს და სხვა ელემენტებს.
# -->

# <!DOCTYPE html>
# <html>
# <head>
#     <title>HTML მაგალითი</title>
# </head>
# <body>
#     <!-- h1 არის ჰედინგი, ანუ სათაურის ელემენტი -->
#     <h1>გამარჯობა, მსოფლიო!</h1>

#     <!-- p არის პარაგრაფი, ანუ ტექსტის ბლოკი -->
#     <p>ეს არის ჩემი პირველი HTML გვერდი.</p>
# </body>
# </html>
 
#  5)გადაიმეორეთ განვლილი მასალა 