# 1) ახსენით კომენტარის სახით განსხვავები (inline,internal და  external) შორის.

# Inline CSS - ეს არის სტილი, რომელიც პირდაპირ ელემენტშია ჩაწერილი, მაგალითად: <p style="color: red;">ეს არის წითელი ტექსტი</p>

# Internal CSS - ეს არის სტილი, რომელიც ჩაწერილია <style> ტეგში HTML დოკუმენტის <head> ნაწილში. ეს სტილი მოქმედებს მხოლოდ იმ დოკუმენტზე, სადაც არის განსაზღვრული.

# External CSS - ეს არის სტილი, რომელიც განთავსებულია ცალკე CSS ფაილში და უკავშირდება HTML დოკუმენტს <link> ტეგის მეშვეობით. ეს სტილი შეიძლება გამოყენებულ იქნას რამდენიმე HTML დოკუმენტზე.